apulse
bashmount
betterlockscreen
bluez-hcitool
gitkraken
informant
inxi
lazydocker
logiops-git
meshlab
mullvad-vpn
neovim-nightly
neovim-plug
nerd-fonts-jetbrains-mono
otf-openmoji
pacman-cleanup-hook
picom-tryone-git
qmk-git
ryzen-stabilizator-git
slack-desktop
spectrwm-git
spotify
st-luke-git
stig
yay
zoom
