tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Implementation of the DNS protocols
brew "bind"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Binary installation for rust projects
brew "cargo-binstall"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Free lossless audio codec
brew "flac"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Text-to-HTML conversion tool
brew "markdown"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Object-relational database system
brew "postgresql@16"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# TOML toolkit written in Rust
brew "taplo"
# Official documentation format of the GNU project
brew "texinfo"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Archive manager for data compression and backups
cask "rar"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
