a52dec
alacritty
alsa-firmware
alsa-utils
amd-ucode
arandr
arm-none-eabi-binutils
arm-none-eabi-gcc
arm-none-eabi-newlib
autoconf
autofs
automake
avr-gcc
avr-libc
avrdude
base
beets
binutils
bison
bluez
bluez-utils
calcurse
calibre
chromium
clang
composer
dfu-programmer
dfu-util
dhcpcd
discord
dmenu
dnsmasq
docker
docker-compose
dunst
duplicity
efibootmgr
exfat-utils
exo
faac
faad2
fakeroot
feh
file
findutils
firefox
flex
garcon
gawk
gcc
gettext
git
glu
gnome-keyring
grep
groff
grub
gzip
htop
inotify-tools
jasper
jq
lib32-nvidia-utils
libdca
libmad
libmpeg2
libtool
libusb-compat
linux
linux-firmware
linux-lts
linux-lts-headers
lxappearance
m4
maim
make
mlocate
moc
mousepad
mpc
mpd
msr-tools
ncmpcpp
neofetch
net-tools
networkmanager
nginx
nodejs
noto-fonts-cjk
noto-fonts-emoji
npm
nvidia
nvidia-lts
openssh
orage
os-prober
pacman
pacman-contrib
pandoc
parole
patch
pavucontrol
php
php-fpm
pkgconf
pkgstats
playerctl
prusa-slicer
pulseaudio
pulseaudio-alsa
pulsemixer
python-pip
python-pywal
python2
python2-pip
redshift
reflector
ripgrep
ristretto
rustup
scrot
sed
snes9x
snes9x-gtk
sshfs
steam
sudo
termite
texinfo
texlive-bibtexextra
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
texstudio
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
transmission-cli
tree
ttf-joypixels
ttf-liberation
ttf-linux-libertine
tumbler
udisks2
unrar
unzip
vi
vim
vlc
wget
which
wireguard-tools
xautolock
xclip
xdg-user-dirs
xdg-utils
xf86-video-vesa
xfburn
xfce4-appfinder
xfce4-artwork
xfce4-battery-plugin
xfce4-clipman-plugin
xfce4-cpufreq-plugin
xfce4-cpugraph-plugin
xfce4-datetime-plugin
xfce4-dict
xfce4-diskperf-plugin
xfce4-eyes-plugin
xfce4-fsguard-plugin
xfce4-genmon-plugin
xfce4-mailwatch-plugin
xfce4-mount-plugin
xfce4-mpc-plugin
xfce4-netload-plugin
xfce4-notes-plugin
xfce4-notifyd
xfce4-panel
xfce4-power-manager
xfce4-pulseaudio-plugin
xfce4-screensaver
xfce4-screenshooter
xfce4-sensors-plugin
xfce4-session
xfce4-settings
xfce4-smartbookmark-plugin
xfce4-systemload-plugin
xfce4-taskmanager
xfce4-terminal
xfce4-time-out-plugin
xfce4-timer-plugin
xfce4-verve-plugin
xfce4-wavelan-plugin
xfce4-weather-plugin
xfce4-whiskermenu-plugin
xfce4-xkb-plugin
xfconf
xfdesktop
xfwm4
xfwm4-themes
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-luit
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-server-xwayland
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xbacklight
xorg-xcalc
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xpr
xorg-xrandr
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
zathura
zathura-pdf-mupdf
zip
zsh
